Revit 2024 API
ImporterIFC.ProcessIFCProject Method
Overload List
Name | Description
ProcessIFCProject(IFCAnyHandle)
 The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements.
ProcessIFCProject(IFCAnyHandle, IDictionary<IFCAnyHandle, ElementId>)
See Also
ImporterIFC Class
ImporterIFC Members
Autodesk.Revit.DB.IFC Namespace